analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/spi_regs.h
#define MXC_F_SPI_CTRL0_SS_IO_POS                      4 /**< CTRL0_SS_IO Position */
#define MXC_F_SPI_CTRL0_SS_IO                          ((uint32_t)(0x1UL << MXC_F_SPI_CTRL0_SS_IO_POS)) /**< CTRL0_SS_IO Mask */
#define MXC_V_SPI_CTRL0_SS_IO_OUTPUT                   ((uint32_t)0x0UL) /**< CTRL0_SS_IO_OUTPUT Value */
#define MXC_S_SPI_CTRL0_SS_IO_OUTPUT                   (MXC_V_SPI_CTRL0_SS_IO_OUTPUT << MXC_F_SPI_CTRL0_SS_IO_POS) /**< CTRL0_SS_IO_OUTPUT Setting */
#define MXC_V_SPI_CTRL0_SS_IO_INPUT                    ((uint32_t)0x1UL) /**< CTRL0_SS_IO_INPUT Value */
#define MXC_S_SPI_CTRL0_SS_IO_INPUT                    (MXC_V_SPI_CTRL0_SS_IO_INPUT << MXC_F_SPI_CTRL0_SS_IO_POS) /**< CTRL0_SS_IO_INPUT Setting */

#define MXC_F_SPI_CTRL0_START_POS                      5 /**< CTRL0_START Position */
#define MXC_F_SPI_CTRL0_START                          ((uint32_t)(0x1UL << MXC_F_SPI_CTRL0_START_POS)) /**< CTRL0_START Mask */
#define MXC_V_SPI_CTRL0_START_START                    ((uint32_t)0x1UL) /**< CTRL0_START_START Value */
#define MXC_S_SPI_CTRL0_START_START                    (MXC_V_SPI_CTRL0_START_START << MXC_F_SPI_CTRL0_START_POS) /**< CTRL0_START_START Setting */

#define MXC_F_SPI_CTRL0_SS_CTRL_POS                    8 /**< CTRL0_SS_CTRL Position */
#define MXC_F_SPI_CTRL0_SS_CTRL                        ((uint32_t)(0x1UL << MXC_F_SPI_CTRL0_SS_CTRL_POS)) /**< CTRL0_SS_CTRL Mask */
#define MXC_V_SPI_CTRL0_SS_CTRL_DEASSERT               ((uint32_t)0x0UL) /**< CTRL0_SS_CTRL_DEASSERT Value */
#define MXC_S_SPI_CTRL0_SS_CTRL_DEASSERT               (MXC_V_SPI_CTRL0_SS_CTRL_DEASSERT << MXC_F_SPI_CTRL0_SS_CTRL_POS) /**< CTRL0_SS_CTRL_DEASSERT Setting */
#define MXC_V_SPI_CTRL0_SS_CTRL_ASSERT                 ((uint32_t)0x1UL) /**< CTRL0_SS_CTRL_ASSERT Value */
#define MXC_S_SPI_CTRL0_SS_CTRL_ASSERT                 (MXC_V_SPI_CTRL0_SS_CTRL_ASSERT << MXC_F_SPI_CTRL0_SS_CTRL_POS) /**< CTRL0_SS_CTRL_ASSERT Setting */

#define MXC_F_SPI_CTRL0_SS_SEL_POS                     16 /**< CTRL0_SS_SEL Position */
#define MXC_F_SPI_CTRL0_SS_SEL                         ((uint32_t)(0xFUL << MXC_F_SPI_CTRL0_SS_SEL_POS)) /**< CTRL0_SS_SEL Mask */
#define MXC_V_SPI_CTRL0_SS_SEL_SS0                     ((uint32_t)0x1UL) /**< CTRL0_SS_SEL_SS0 Value */
#define MXC_S_SPI_CTRL0_SS_SEL_SS0                     (MXC_V_SPI_CTRL0_SS_SEL_SS0 << MXC_F_SPI_CTRL0_SS_SEL_POS) /**< CTRL0_SS_SEL_SS0 Setting */
#define MXC_V_SPI_CTRL0_SS_SEL_SS1                     ((uint32_t)0x2UL) /**< CTRL0_SS_SEL_SS1 Value */
#define MXC_S_SPI_CTRL0_SS_SEL_SS1                     (MXC_V_SPI_CTRL0_SS_SEL_SS1 << MXC_F_SPI_CTRL0_SS_SEL_POS) /**< CTRL0_SS_SEL_SS1 Setting */
#define MXC_V_SPI_CTRL0_SS_SEL_SS2                     ((uint32_t)0x4UL) /**< CTRL0_SS_SEL_SS2 Value */
#define MXC_S_SPI_CTRL0_SS_SEL_SS2                     (MXC_V_SPI_CTRL0_SS_SEL_SS2 << MXC_F_SPI_CTRL0_SS_SEL_POS) /**< CTRL0_SS_SEL_SS2 Setting */
#define MXC_V_SPI_CTRL0_SS_SEL_SS3                     ((uint32_t)0x8UL) /**< CTRL0_SS_SEL_SS3 Value */
#define MXC_S_SPI_CTRL0_SS_SEL_SS3                     (MXC_V_SPI_CTRL0_SS_SEL_SS3 << MXC_F_SPI_CTRL0_SS_SEL_POS) /**< CTRL0_SS_SEL_SS3 Setting */

/**@} end of group SPI_CTRL0_Register */

/**
 * @ingroup  spi_registers
 * @defgroup SPI_CTRL1 SPI_CTRL1
 * @brief    Register for controlling SPI peripheral.
 * @{
 */
#define MXC_F_SPI_CTRL1_TX_NUM_CHAR_POS                0 /**< CTRL1_TX_NUM_CHAR Position */
#define MXC_F_SPI_CTRL1_TX_NUM_CHAR                    ((uint32_t)(0xFFFFUL << MXC_F_SPI_CTRL1_TX_NUM_CHAR_POS)) /**< CTRL1_TX_NUM_CHAR Mask */

#define MXC_F_SPI_CTRL1_RX_NUM_CHAR_POS                16 /**< CTRL1_RX_NUM_CHAR Position */
#define MXC_F_SPI_CTRL1_RX_NUM_CHAR                    ((uint32_t)(0xFFFFUL << MXC_F_SPI_CTRL1_RX_NUM_CHAR_POS)) /**< CTRL1_RX_NUM_CHAR Mask */

/**@} end of group SPI_CTRL1_Register */

/**
 * @ingroup  spi_registers
 * @defgroup SPI_CTRL2 SPI_CTRL2
 * @brief    Register for controlling SPI peripheral.
 * @{
 */
#define MXC_F_SPI_CTRL2_CLK_PHA_POS                    0 /**< CTRL2_CLK_PHA Position */
#define MXC_F_SPI_CTRL2_CLK_PHA                        ((uint32_t)(0x1UL << MXC_F_SPI_CTRL2_CLK_PHA_POS)) /**< CTRL2_CLK_PHA Mask */
#define MXC_V_SPI_CTRL2_CLK_PHA_RISINGEDGE             ((uint32_t)0x0UL) /**< CTRL2_CLK_PHA_RISINGEDGE Value */
#define MXC_S_SPI_CTRL2_CLK_PHA_RISINGEDGE             (MXC_V_SPI_CTRL2_CLK_PHA_RISINGEDGE << MXC_F_SPI_CTRL2_CLK_PHA_POS) /**< CTRL2_CLK_PHA_RISINGEDGE Setting */
#define MXC_V_SPI_CTRL2_CLK_PHA_FALLINGEDGE            ((uint32_t)0x1UL) /**< CTRL2_CLK_PHA_FALLINGEDGE Value */
#define MXC_S_SPI_CTRL2_CLK_PHA_FALLINGEDGE            (MXC_V_SPI_CTRL2_CLK_PHA_FALLINGEDGE << MXC_F_SPI_CTRL2_CLK_PHA_POS) /**< CTRL2_CLK_PHA_FALLINGEDGE Setting */

#define MXC_F_SPI_CTRL2_CLK_POL_POS                    1 /**< CTRL2_CLK_POL Position */
#define MXC_F_SPI_CTRL2_CLK_POL                        ((uint32_t)(0x1UL << MXC_F_SPI_CTRL2_CLK_POL_POS)) /**< CTRL2_CLK_POL Mask */
#define MXC_V_SPI_CTRL2_CLK_POL_NORMAL                 ((uint32_t)0x0UL) /**< CTRL2_CLK_POL_NORMAL Value */
#define MXC_S_SPI_CTRL2_CLK_POL_NORMAL                 (MXC_V_SPI_CTRL2_CLK_POL_NORMAL << MXC_F_SPI_CTRL2_CLK_POL_POS) /**< CTRL2_CLK_POL_NORMAL Setting */
#define MXC_V_SPI_CTRL2_CLK_POL_INVERTED               ((uint32_t)0x1UL) /**< CTRL2_CLK_POL_INVERTED Value */
#define MXC_S_SPI_CTRL2_CLK_POL_INVERTED               (MXC_V_SPI_CTRL2_CLK_POL_INVERTED << MXC_F_SPI_CTRL2_CLK_POL_POS) /**< CTRL2_CLK_POL_INVERTED Setting */

#define MXC_F_SPI_CTRL2_NUM_BITS_POS                   8 /**< CTRL2_NUM_BITS Position */
#define MXC_F_SPI_CTRL2_NUM_BITS                       ((uint32_t)(0xFUL << MXC_F_SPI_CTRL2_NUM_BITS_POS)) /**< CTRL2_NUM_BITS Mask */
#define MXC_V_SPI_CTRL2_NUM_BITS_16BITS                ((uint32_t)0x0UL) /**< CTRL2_NUM_BITS_16BITS Value */
#define MXC_S_SPI_CTRL2_NUM_BITS_16BITS                (MXC_V_SPI_CTRL2_NUM_BITS_16BITS << MXC_F_SPI_CTRL2_NUM_BITS_POS) /**< CTRL2_NUM_BITS_16BITS Setting */
#define MXC_V_SPI_CTRL2_NUM_BITS_1BITS                 ((uint32_t)0x1UL) /**< CTRL2_NUM_BITS_1BITS Value */
#define MXC_S_SPI_CTRL2_NUM_BITS_1BITS                 (MXC_V_SPI_CTRL2_NUM_BITS_1BITS << MXC_F_SPI_CTRL2_NUM_BITS_POS) /**< CTRL2_NUM_BITS_1BITS Setting */
#define MXC_V_SPI_CTRL2_NUM_BITS_2BITS                 ((uint32_t)0x2UL) /**< CTRL2_NUM_BITS_2BITS Value */
#define MXC_S_SPI_CTRL2_NUM_BITS_2BITS                 (MXC_V_SPI_CTRL2_NUM_BITS_2BITS << MXC_F_SPI_CTRL2_NUM_BITS_POS) /**< CTRL2_NUM_BITS_2BITS Setting */
#define MXC_V_SPI_CTRL2_NUM_BITS_3BITS                 ((uint32_t)0x3UL) /**< CTRL2_NUM_BITS_3BITS Value */
#define MXC_S_SPI_CTRL2_NUM_BITS_3BITS                 (MXC_V_SPI_CTRL2_NUM_BITS_3BITS << MXC_F_SPI_CTRL2_NUM_BITS_POS) /**< CTRL2_NUM_BITS_3BITS Setting */
#define MXC_V_SPI_CTRL2_NUM_BITS_4BITS                 ((uint32_t)0x4UL) /**< CTRL2_NUM_BITS_4BITS Value */
#define MXC_S_SPI_CTRL2_NUM_BITS_4BITS                 (MXC_V_SPI_CTRL2_NUM_BITS_4BITS << MXC_F_SPI_CTRL2_NUM_BITS_POS) /**< CTRL2_NUM_BITS_4BITS Setting */
#define MXC_V_SPI_CTRL2_NUM_BITS_5BITS                 ((uint32_t)0x5UL) /**< CTRL2_NUM_BITS_5BITS Value */
#define MXC_S_SPI_CTRL2_NUM_BITS_5BITS                 (MXC_V_SPI_CTRL2_NUM_BITS_5BITS << MXC_F_SPI_CTRL2_NUM_BITS_POS) /**< CTRL2_NUM_BITS_5BITS Setting */
#define MXC_V_SPI_CTRL2_NUM_BITS_6BITS                 ((uint32_t)0x6UL) /**< CTRL2_NUM_BITS_6BITS Value */
#define MXC_S_SPI_CTRL2_NUM_BITS_6BITS                 (MXC_V_SPI_CTRL2_NUM_BITS_6BITS << MXC_F_SPI_CTRL2_NUM_BITS_POS) /**< CTRL2_NUM_BITS_6BITS Setting */
#define MXC_V_SPI_CTRL2_NUM_BITS_7BITS                 ((uint32_t)0x7UL) /**< CTRL2_NUM_BITS_7BITS Value */
#define MXC_S_SPI_CTRL2_NUM_BITS_7BITS                 (MXC_V_SPI_CTRL2_NUM_BITS_7BITS << MXC_F_SPI_CTRL2_NUM_BITS_POS) /**< CTRL2_NUM_BITS_7BITS Setting */
#define MXC_V_SPI_CTRL2_NUM_BITS_8BITS                 ((uint32_t)0x8UL) /**< CTRL2_NUM_BITS_8BITS Value */
#define MXC_S_SPI_CTRL2_NUM_BITS_8BITS                 (MXC_V_SPI_CTRL2_NUM_BITS_8BITS << MXC_F_SPI_CTRL2_NUM_BITS_POS) /**< CTRL2_NUM_BITS_8BITS Setting */
#define MXC_V_SPI_CTRL2_NUM_BITS_9BITS                 ((uint32_t)0x9UL) /**< CTRL2_NUM_BITS_9BITS Value */
#define MXC_S_SPI_CTRL2_NUM_BITS_9BITS                 (MXC_V_SPI_CTRL2_NUM_BITS_9BITS << MXC_F_SPI_CTRL2_NUM_BITS_POS) /**< CTRL2_NUM_BITS_9BITS Setting */
#define MXC_V_SPI_CTRL2_NUM_BITS_10BITS                ((uint32_t)0xAUL) /**< CTRL2_NUM_BITS_10BITS Value */
#define MXC_S_SPI_CTRL2_NUM_BITS_10BITS                (MXC_V_SPI_CTRL2_NUM_BITS_10BITS << MXC_F_SPI_CTRL2_NUM_BITS_POS) /**< CTRL2_NUM_BITS_10BITS Setting */
#define MXC_V_SPI_CTRL2_NUM_BITS_11BITS                ((uint32_t)0xBUL) /**< CTRL2_NUM_BITS_11BITS Value */
#define MXC_S_SPI_CTRL2_NUM_BITS_11BITS                (MXC_V_SPI_CTRL2_NUM_BITS_11BITS << MXC_F_SPI_CTRL2_NUM_BITS_POS) /**< CTRL2_NUM_BITS_11BITS Setting */
#define MXC_V_SPI_CTRL2_NUM_BITS_12BITS                ((uint32_t)0xCUL) /**< CTRL2_NUM_BITS_12BITS Value */
#define MXC_S_SPI_CTRL2_NUM_BITS_12BITS                (MXC_V_SPI_CTRL2_NUM_BITS_12BITS << MXC_F_SPI_CTRL2_NUM_BITS_POS) /**< CTRL2_NUM_BITS_12BITS Setting */
#define MXC_V_SPI_CTRL2_NUM_BITS_13BITS                ((uint32_t)0xDUL) /**< CTRL2_NUM_BITS_13BITS Value */
#define MXC_S_SPI_CTRL2_NUM_BITS_13BITS                (MXC_V_SPI_CTRL2_NUM_BITS_13BITS << MXC_F_SPI_CTRL2_NUM_BITS_POS) /**< CTRL2_NUM_BITS_13BITS Setting */
#define MXC_V_SPI_CTRL2_NUM_BITS_14BITS                ((uint32_t)0xEUL) /**< CTRL2_NUM_BITS_14BITS Value */
#define MXC_S_SPI_CTRL2_NUM_BITS_14BITS                (MXC_V_SPI_CTRL2_NUM_BITS_14BITS << MXC_F_SPI_CTRL2_NUM_BITS_POS) /**< CTRL2_NUM_BITS_14BITS Setting */
#define MXC_V_SPI_CTRL2_NUM_BITS_15BITS                ((uint32_t)0xFUL) /**< CTRL2_NUM_BITS_15BITS Value */
#define MXC_S_SPI_CTRL2_NUM_BITS_15BITS                (MXC_V_SPI_CTRL2_NUM_BITS_15BITS << MXC_F_SPI_CTRL2_NUM_BITS_POS) /**< CTRL2_NUM_BITS_15BITS Setting */

#define MXC_F_SPI_CTRL2_BUS_WIDTH_POS                  12 /**< CTRL2_BUS_WIDTH Position */
#define MXC_F_SPI_CTRL2_BUS_WIDTH                      ((uint32_t)(0x3UL << MXC_F_SPI_CTRL2_BUS_WIDTH_POS)) /**< CTRL2_BUS_WIDTH Mask */
#define MXC_V_SPI_CTRL2_BUS_WIDTH_MONO                 ((uint32_t)0x0UL) /**< CTRL2_BUS_WIDTH_MONO Value */
#define MXC_S_SPI_CTRL2_BUS_WIDTH_MONO                 (MXC_V_SPI_CTRL2_BUS_WIDTH_MONO << MXC_F_SPI_CTRL2_BUS_WIDTH_POS) /**< CTRL2_BUS_WIDTH_MONO Setting */
#define MXC_V_SPI_CTRL2_BUS_WIDTH_DUAL                 ((uint32_t)0x1UL) /**< CTRL2_BUS_WIDTH_DUAL Value */
#define MXC_S_SPI_CTRL2_BUS_WIDTH_DUAL                 (MXC_V_SPI_CTRL2_BUS_WIDTH_DUAL << MXC_F_SPI_CTRL2_BUS_WIDTH_POS) /**< CTRL2_BUS_WIDTH_DUAL Setting */
#define MXC_V_SPI_CTRL2_BUS_WIDTH_QUAD                 ((uint32_t)0x2UL) /**< CTRL2_BUS_WIDTH_QUAD Value */
#define MXC_S_SPI_CTRL2_BUS_WIDTH_QUAD                 (MXC_V_SPI_CTRL2_BUS_WIDTH_QUAD << MXC_F_SPI_CTRL2_BUS_WIDTH_POS) /**< CTRL2_BUS_WIDTH_QUAD Setting */

#define MXC_F_SPI_CTRL2_THREE_WIRE_POS                 15 /**< CTRL2_THREE_WIRE Position */
#define MXC_F_SPI_CTRL2_THREE_WIRE                     ((uint32_t)(0x1UL << MXC_F_SPI_CTRL2_THREE_WIRE_POS)) /**< CTRL2_THREE_WIRE Mask */
#define MXC_V_SPI_CTRL2_THREE_WIRE_4WIRE               ((uint32_t)0x0UL) /**< CTRL2_THREE_WIRE_4WIRE Value */
#define MXC_S_SPI_CTRL2_THREE_WIRE_4WIRE               (MXC_V_SPI_CTRL2_THREE_WIRE_4WIRE << MXC_F_SPI_CTRL2_THREE_WIRE_POS) /**< CTRL2_THREE_WIRE_4WIRE Setting */
#define MXC_V_SPI_CTRL2_THREE_WIRE_3WIRE               ((uint32_t)0x1UL) /**< CTRL2_THREE_WIRE_3WIRE Value */
#define MXC_S_SPI_CTRL2_THREE_WIRE_3WIRE               (MXC_V_SPI_CTRL2_THREE_WIRE_3WIRE << MXC_F_SPI_CTRL2_THREE_WIRE_POS) /**< CTRL2_THREE_WIRE_3WIRE Setting */

